Tekla Open API Reference for Tekla Structures 2025
Localization.LocalizeToolTip Method
 Localizes a ToolTip control.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void LocalizeToolTip(
	Control control,
	ToolTip toolTip
)
Public Sub LocalizeToolTip (
	control As Control,
	toolTip As ToolTip
)
Parameters
control
Type: System.Windows.Forms.Control
The root control for all the controls which should be localized.
toolTip
Type: System.Windows.Forms.ToolTip
The ToolTip instance.
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace